Revit 2027 API
Gradient.GradientNoiseSize Property
 The property labeled "Size" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GradientNoiseSize { get; }
Public Shared ReadOnly Property GradientNoiseSize As String
	Get
public:
static property String^ GradientNoiseSize {
	String^ get ();
}
static member GradientNoiseSize : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".
See Also
Reference
Gradient Class
Autodesk.Revit.DB.Visual Namespace